{"format":"csv","ignoreLeadingWhiteSpaceReading":false,"multiLine":null,"path":"dbfs:/Prophecy/70a2cc2d19d69d2d168cbcb89663b7cb/CustomersDatasetInput.csv","ignoreTrailingWhiteSpaceReading":false,"maxColumns":null,"writeMode":"error","description":"This dataset is derived from a CSV file and contains detailed information about customers, including their unique customer IDs, first and last names, phone numbers, email addresses, country codes, account opening dates, and account flags. This data is valuable for analyzing customer behavior, identifying trends, and making informed business decisions. It can be used to segment customers, develop targeted marketing strategies, and evaluate customer satisfaction levels.","separator":",","compression":null,"nullValue":null,"nanValue":null,"escapeQuotes":null,"charToEscapeQuoteEscaping":null,"encoding":null,"inferSchema":null,"enforceSchema":null,"quoteAll":null,"ignoreLeadingWhiteSpaceWriting":true,"locale":null,"quote":null,"timestampFormat":null,"emptyValue":null,"recursiveFileLookup":null,"partitionColumns":null,"schema":{"type":"struct","fields":[{"name":"customer_id","type":"integer","nullable":true,"metadata":{"description":"A unique identifier assigned to each customer in the dataset. It stores numerical values in integer data type and serves as a primary key for the customers table. This column is used to uniquely identify each customer and link their orders and other related data.","mappings":[],"tags":[]}},{"name":"first_name","type":"string","nullable":true,"metadata":{"description":"The first name of each customer is stored in this column. It stores values of string data type and provides a way to identify each customer by their first name.","mappings":[],"tags":[]}},{"name":"last_name","type":"string","nullable":true,"metadata":{"description":"The last name of each customer is stored in this column. It contains string values and provides a way to identify customers based on their family name. This information can be useful for personalization and segmentation purposes.","mappings":[],"tags":[]}},{"name":"phone","type":"string","nullable":true,"metadata":{"description":"Stores the phone number of each customer. The values in this column are of string data type and provide a way to contact each customer. It is recommended to format the phone numbers consistently to ensure accurate communication with customers.","mappings":[],"tags":[]}},{"name":"email","type":"string","nullable":true,"metadata":{"description":"Stores the email address of each customer. The values in this column are of string data type and provide a way to contact customers via email. It is a unique identifier for each customer and can be used for communication and marketing purposes.","mappings":[],"tags":[]}},{"name":"country_code","type":"string","nullable":true,"metadata":{"description":"Represents the country code of each customer's location. It stores values in string data type and provides information about the geographic location of each customer. This column can be used to analyze customer demographics and behavior based on their country of origin.","mappings":[],"tags":[]}},{"name":"account_open_date","type":"string","nullable":true,"metadata":{"description":"The date on which the customer's account was opened. This column stores values in string data type and provides information about the account's creation date. It can be used to track the age of the account and analyze customer behavior over time.","mappings":[],"tags":[]}},{"name":"account_flags","type":"string","nullable":true,"metadata":{"description":"This column stores information about the account status of each customer. It contains string values that indicate whether the account is active, inactive, or has any other special flags associated with it. This information can be used to track customer behavior and preferences.","mappings":[],"tags":[]}}]},"escape":null,"unescapedQuoteHandling":null,"positiveInf":null,"comment":null,"lineSep":null,"componentInfo":{"gemId":"gitUri=http://gitserver:3000/DxEheDCJ_team_5751/DxEheDCJ_project_12654.git&subPath=&tag=0.2.4&projectSubscriptionProjectId=12654&path=gems/csv","projectName":"ProphecySparkBasicsPython"},"samplingRatio":null,"dateFormat":null,"mode":null,"header":true,"columnNameOfCorruptRecord":null,"modifiedBefore":null,"ignoreTrailingWhiteSpaceWriting":true,"maxCharsPerColumn":null,"negativeInf":null,"createSingleOutputFile":null,"pathGlobFilter":null,"datasetType":"File","useSchema":true,"modifiedAfter":null}